# Exercice 1 

Reproduisez le tutoriel en le traduisant (y compris au niveau
du code) en Français jusqu’à la section Reshaping (inclus - Vous vous arrêterez avant la partie Time Series).

URL: http://pandas.pydata.org/pandas-docs/stable/10min.html

# 10 minutes pour apprendre Pandas

In [1]:
## importation des fichiers 
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# Creation d'objet

création de serie:

In [2]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

Création d'un DataFrame en utilisant un tableau numpy, avec un index datetime et des colonnes étiquetées:

In [3]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  0.304327  0.222555 -0.504071 -0.562967
2013-01-02 -0.013875 -0.941108  0.354864  1.171795
2013-01-03 -0.292422  0.930394  0.759982 -0.713126
2013-01-04  1.735341 -1.560879  1.715756 -0.328380
2013-01-05  0.126835 -1.843297  0.213609 -0.238256
2013-01-06  1.127755 -1.077915 -0.857795  1.943030

Création d'un DataFrame en utilisant un dict d'objets qui peuvent être convertis en séries.

In [5]:
df2 = pd.DataFrame({ 'A' : 1.,
                    'B' : pd.Timestamp('20130102'),
                    'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                    'D' : np.array([3] * 4,dtype='int32'),
                    'E' : pd.Categorical(["test","train","test","train"]),
                    'F' : 'foo' })
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

Avoir des dtypes specific

In [6]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

Si vous utilisez IPython, l'achèvement des tabulations (tab complexion) pour les noms de colonnes (ainsi que les attributs publics) est automatiquement activé. Voici un sous-ensemble des attributs qui seront complétés:

 df2.<TAB>
df2.A                  df2.bool
df2.abs                df2.boxplot
df2.add                df2.C
df2.add_prefix         df2.clip
df2.add_suffix         df2.clip_lower
df2.align              df2.clip_upper
df2.all                df2.columns
df2.any                df2.combine
df2.append             df2.combine_first
df2.apply              df2.compound
df2.applymap           df2.consolidate
df2.D

Comme vous pouvez le voir, les colonnes A, B, C et D sont automatiquement complétées. E aussi d'ailleurs; le reste des attributs a été tronqué par souci de concision.

# Visualisation des données

In [7]:
df.head()

                   A         B         C         D
2013-01-01  0.304327  0.222555 -0.504071 -0.562967
2013-01-02 -0.013875 -0.941108  0.354864  1.171795
2013-01-03 -0.292422  0.930394  0.759982 -0.713126
2013-01-04  1.735341 -1.560879  1.715756 -0.328380
2013-01-05  0.126835 -1.843297  0.213609 -0.238256

In [8]:
df.tail(3)

                   A         B         C         D
2013-01-04  1.735341 -1.560879  1.715756 -0.328380
2013-01-05  0.126835 -1.843297  0.213609 -0.238256
2013-01-06  1.127755 -1.077915 -0.857795  1.943030

Afficher l'index, les colonnes et les données numériques (numpy data) sous-jacentes

In [9]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [11]:
 df.values

array([[ 0.30432727,  0.22255482, -0.50407083, -0.56296666],
       [-0.01387532, -0.94110765,  0.35486413,  1.17179484],
       [-0.29242162,  0.93039418,  0.75998188, -0.71312618],
       [ 1.73534147, -1.5608787 ,  1.71575556, -0.3283803 ],
       [ 0.12683544, -1.8432974 ,  0.21360918, -0.23825643],
       [ 1.12775454, -1.07791472, -0.85779539,  1.9430296 ]])

afficher un résumé rapide au niveau statistique (summary) de vos données -> on utilise describe

In [12]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.497994 -0.711708  0.280391  0.212016
std    0.773261  1.073095  0.917729  1.083406
min   -0.292422 -1.843297 -0.857795 -0.713126
25%    0.021302 -1.440138 -0.324651 -0.504320
50%    0.215581 -1.009511  0.284237 -0.283318
75%    0.921898 -0.068361  0.658702  0.819282
max    1.735341  0.930394  1.715756  1.943030

Transposer vos données -> T

In [13]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.304327   -0.013875   -0.292422    1.735341    0.126835    1.127755
B    0.222555   -0.941108    0.930394   -1.560879   -1.843297   -1.077915
C   -0.504071    0.354864    0.759982    1.715756    0.213609   -0.857795
D   -0.562967    1.171795   -0.713126   -0.328380   -0.238256    1.943030

 trier par un axe : -> axis =1 (A,B,C,D)
                       axis = 0 (dates) 
 l'exemple suivant est descendant

In [14]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.562967 -0.504071  0.222555  0.304327
2013-01-02  1.171795  0.354864 -0.941108 -0.013875
2013-01-03 -0.713126  0.759982  0.930394 -0.292422
2013-01-04 -0.328380  1.715756 -1.560879  1.735341
2013-01-05 -0.238256  0.213609 -1.843297  0.126835
2013-01-06  1.943030 -0.857795 -1.077915  1.127755

In [15]:
df

                   A         B         C         D
2013-01-01  0.304327  0.222555 -0.504071 -0.562967
2013-01-02 -0.013875 -0.941108  0.354864  1.171795
2013-01-03 -0.292422  0.930394  0.759982 -0.713126
2013-01-04  1.735341 -1.560879  1.715756 -0.328380
2013-01-05  0.126835 -1.843297  0.213609 -0.238256
2013-01-06  1.127755 -1.077915 -0.857795  1.943030

tri par valeurs

In [16]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-05  0.126835 -1.843297  0.213609 -0.238256
2013-01-04  1.735341 -1.560879  1.715756 -0.328380
2013-01-06  1.127755 -1.077915 -0.857795  1.943030
2013-01-02 -0.013875 -0.941108  0.354864  1.171795
2013-01-01  0.304327  0.222555 -0.504071 -0.562967
2013-01-03 -0.292422  0.930394  0.759982 -0.713126

# selection

Remarque :  Bien que les expressions Python / Numpy standard pour la sélection et le paramétrage soient intuitives et pratiques pour le travail interactif, pour le code de production, nous recommandons les méthodes d'accès aux données pandas optimisées, .at, .iat, .loc, .iloc et .ix.

# getting

Sélection d'une seule colonne, qui donne une série, équivalent à df.A.

In [17]:
df['A']

2013-01-01    0.304327
2013-01-02   -0.013875
2013-01-03   -0.292422
2013-01-04    1.735341
2013-01-05    0.126835
2013-01-06    1.127755
Freq: D, Name: A, dtype: float64

slicing

In [18]:
df[0:3]

                   A         B         C         D
2013-01-01  0.304327  0.222555 -0.504071 -0.562967
2013-01-02 -0.013875 -0.941108  0.354864  1.171795
2013-01-03 -0.292422  0.930394  0.759982 -0.713126

In [19]:
 df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -0.013875 -0.941108  0.354864  1.171795
2013-01-03 -0.292422  0.930394  0.759982 -0.713126
2013-01-04  1.735341 -1.560879  1.715756 -0.328380

Selection par label

section transversale en utilisant une étiquette

In [20]:
df.loc[dates[0]]

A    0.304327
B    0.222555
C   -0.504071
D   -0.562967
Name: 2013-01-01 00:00:00, dtype: float64

Sélection sur un multi-axe par étiquette

In [21]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.304327  0.222555
2013-01-02 -0.013875 -0.941108
2013-01-03 -0.292422  0.930394
2013-01-04  1.735341 -1.560879
2013-01-05  0.126835 -1.843297
2013-01-06  1.127755 -1.077915

Slicing, les deux points de terminaison sont inclus

In [22]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02 -0.013875 -0.941108
2013-01-03 -0.292422  0.930394
2013-01-04  1.735341 -1.560879


Réduction des dimensions de l'objet retourné

In [23]:
df.loc['20130102',['A','B']]

A   -0.013875
B   -0.941108
Name: 2013-01-02 00:00:00, dtype: float64

pour avoir un scalaire

In [24]:
df.loc[dates[0],'A']

0.3043272692281541

pour avoir un acces rapide à un scalaire

In [25]:
df.at[dates[0],'A']

0.3043272692281541

# Selection par position

In [26]:
#avec des entiers
df.iloc[3]

A    1.735341
B   -1.560879
C    1.715756
D   -0.328380
Name: 2013-01-04 00:00:00, dtype: float64

In [27]:
# avec des slices d'entier
df.iloc[3:5,0:2]

                   A         B
2013-01-04  1.735341 -1.560879
2013-01-05  0.126835 -1.843297

In [28]:
# avec les position 
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -0.013875  0.354864
2013-01-03 -0.292422  0.759982
2013-01-05  0.126835  0.213609

In [29]:
 df.iloc[1:3,:]#row

                   A         B         C         D
2013-01-02 -0.013875 -0.941108  0.354864  1.171795
2013-01-03 -0.292422  0.930394  0.759982 -0.713126

In [30]:
df.iloc[:,1:3]#columns

                   B         C
2013-01-01  0.222555 -0.504071
2013-01-02 -0.941108  0.354864
2013-01-03  0.930394  0.759982
2013-01-04 -1.560879  1.715756
2013-01-05 -1.843297  0.213609
2013-01-06 -1.077915 -0.857795

In [31]:
df.iloc[1,1] #valeur explicite

-0.9411076534966466

In [32]:
df.iat[1,1] #plus rapide

-0.9411076534966466

# Indexation booléenne

Utilisation des valeurs d'une seule colonne pour sélectionner des données

In [33]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  0.304327  0.222555 -0.504071 -0.562967
2013-01-04  1.735341 -1.560879  1.715756 -0.328380
2013-01-05  0.126835 -1.843297  0.213609 -0.238256
2013-01-06  1.127755 -1.077915 -0.857795  1.943030

Selecting values from a DataFrame where a boolean condition is met.

In [34]:
df[df > 0]

                   A         B         C         D
2013-01-01  0.304327  0.222555       NaN       NaN
2013-01-02       NaN       NaN  0.354864  1.171795
2013-01-03       NaN  0.930394  0.759982       NaN
2013-01-04  1.735341       NaN  1.715756       NaN
2013-01-05  0.126835       NaN  0.213609       NaN
2013-01-06  1.127755       NaN       NaN  1.943030

Utilisation de la méthode isin () pour le filtrage

In [35]:
df2 = df.copy()
df2['E'] = ['one', 'one','two','three','four','three']
df2

                   A         B         C         D      E
2013-01-01  0.304327  0.222555 -0.504071 -0.562967    one
2013-01-02 -0.013875 -0.941108  0.354864  1.171795    one
2013-01-03 -0.292422  0.930394  0.759982 -0.713126    two
2013-01-04  1.735341 -1.560879  1.715756 -0.328380  three
2013-01-05  0.126835 -1.843297  0.213609 -0.238256   four
2013-01-06  1.127755 -1.077915 -0.857795  1.943030  three

In [36]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -0.292422  0.930394  0.759982 -0.713126   two
2013-01-05  0.126835 -1.843297  0.213609 -0.238256  four

# Setting

La définition d'une nouvelle colonne aligne automatiquement les données par les index

In [37]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [38]:
df['F'] = s1

 Définition des valeurs par libellé (label)

In [39]:
df.at[dates[0],'A'] = 0

definition des valeurs par position

In [40]:
df.iat[0,1] = 0

Réglage par affectation avec un tableau numpy

In [41]:
 df.loc[:,'D'] = np.array([5] * len(df))

resultat des opérations antérieures

In [42]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.504071  5  NaN
2013-01-02 -0.013875 -0.941108  0.354864  5  1.0
2013-01-03 -0.292422  0.930394  0.759982  5  2.0
2013-01-04  1.735341 -1.560879  1.715756  5  3.0
2013-01-05  0.126835 -1.843297  0.213609  5  4.0
2013-01-06  1.127755 -1.077915 -0.857795  5  5.0

une opération where avec parametrage

In [43]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.504071 -5  NaN
2013-01-02 -0.013875 -0.941108 -0.354864 -5 -1.0
2013-01-03 -0.292422 -0.930394 -0.759982 -5 -2.0
2013-01-04 -1.735341 -1.560879 -1.715756 -5 -3.0
2013-01-05 -0.126835 -1.843297 -0.213609 -5 -4.0
2013-01-06 -1.127755 -1.077915 -0.857795 -5 -5.0

# Donnés manquantes

donnés manquantes : np.nan

La réindexation permet de modifier / ajouter / supprimer l'index sur un axe spécifié. Cela renvoie une copie des données.

In [44]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [45]:
df1.loc[dates[0]:dates[1],'E'] = 1

In [46]:
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.504071  5  NaN  1.0
2013-01-02 -0.013875 -0.941108  0.354864  5  1.0  1.0
2013-01-03 -0.292422  0.930394  0.759982  5  2.0  NaN
2013-01-04  1.735341 -1.560879  1.715756  5  3.0  NaN

Pour supprimer des lignes contenant des données manquantes

In [47]:
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02 -0.013875 -0.941108  0.354864  5  1.0  1.0

Remplir les données manquantes

In [48]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.504071  5  5.0  1.0
2013-01-02 -0.013875 -0.941108  0.354864  5  1.0  1.0
2013-01-03 -0.292422  0.930394  0.759982  5  2.0  5.0
2013-01-04  1.735341 -1.560879  1.715756  5  3.0  5.0

Pour obtenir le masque booléen où les valeurs sont 'nan'

In [49]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

# Operation

Stats


Les opérations en général excluent les données manquantes.

In [50]:
df.mean()

A    0.447272
B   -0.748801
C    0.280391
D    5.000000
F    3.000000
dtype: float64

même opération pour l'autre axes

In [51]:
df.mean(1)

2013-01-01    1.123982
2013-01-02    1.079976
2013-01-03    1.679591
2013-01-04    1.978044
2013-01-05    1.499429
2013-01-06    1.838409
Freq: D, dtype: float64

Opérer avec des objets de dimension différente et nécessitant un alignement. En outre, pandas diffuse automatiquement le long de la dimension spécifiée.

In [52]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [53]:
df.sub(s, axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -1.292422 -0.069606 -0.240018  4.0  1.0
2013-01-04 -1.264659 -4.560879 -1.284244  2.0  0.0
2013-01-05 -4.873165 -6.843297 -4.786391  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

# application 

application des fonctions aux données

In [54]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000 -0.504071   5   NaN
2013-01-02 -0.013875 -0.941108 -0.149207  10   1.0
2013-01-03 -0.306297 -0.010713  0.610775  15   3.0
2013-01-04  1.429045 -1.571592  2.326531  20   6.0
2013-01-05  1.555880 -3.414890  2.540140  25  10.0
2013-01-06  2.683635 -4.492804  1.682345  30  15.0

In [55]:
df.apply(lambda x: x.max() - x.min())

A    2.027763
B    2.773692
C    2.573551
D    0.000000
F    4.000000
dtype: float64

# histogramming

In [56]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    6
1    6
2    0
3    4
4    4
5    3
6    2
7    5
8    4
9    1
dtype: int32

In [57]:
s.value_counts()

4    3
6    2
5    1
3    1
2    1
1    1
0    1
dtype: int64

# string méthodes

Series est équipé d'un ensemble de méthodes de traitement de chaîne dans l'attribut str qui le rendent facile à utiliser sur chaque élément du tableau, comme dans l'extrait de code ci-dessous. 
Notez que pattern-matching dans str utilise généralement des expressions régulières par défaut (et dans certains cas les utilise toujours).

In [58]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

# Fusion 

Concat 


pandas facilites des objets Series, DataFrame et Panel avec différents types de logique d'ensemble pour les index et la fonctionnalité d'algèbre relationnelle dans le cas d'opérations de type join / merge.

On conncate les objets pandas ensemble avec 'concat()'

In [59]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0  0.263188 -1.242611  0.590598  0.248996
1  0.373309 -0.304218  0.915542  0.724222
2 -1.742569 -0.144867  1.145188  0.423133
3 -0.752301 -1.585933  1.067289 -0.406163
4  1.252578  1.235714 -0.641891 -0.038169
5  0.992335 -0.989658 -0.182827  0.535144
6  1.307409 -0.506904 -1.021533  0.165381
7  0.801969  1.406706  0.335915  0.520500
8  0.266681 -1.252264  0.741254  1.086886
9 -1.549789 -1.477356  0.936838  1.922500

In [60]:
pieces = [df[:3], df[3:7], df[7:]] #sépare en differents morceaux

In [61]:
pd.concat(pieces)

          0         1         2         3
0  0.263188 -1.242611  0.590598  0.248996
1  0.373309 -0.304218  0.915542  0.724222
2 -1.742569 -0.144867  1.145188  0.423133
3 -0.752301 -1.585933  1.067289 -0.406163
4  1.252578  1.235714 -0.641891 -0.038169
5  0.992335 -0.989658 -0.182827  0.535144
6  1.307409 -0.506904 -1.021533  0.165381
7  0.801969  1.406706  0.335915  0.520500
8  0.266681 -1.252264  0.741254  1.086886
9 -1.549789 -1.477356  0.936838  1.922500

# Jointure
SQL fusionne (merge) les styles.

In [65]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})
left

   key  lval
0  foo     1
1  foo     2

In [64]:
right

   key  rval
0  foo     4
1  foo     5

In [66]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

Autre exemple :

In [67]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})
left

   key  lval
0  foo     1
1  bar     2

In [68]:
right

   key  rval
0  foo     4
1  bar     5

In [69]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

# Ajout
Ajout d'une ligne à un DataFrame

In [71]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])
df

          A         B         C         D
0 -0.820065  0.689890 -0.094470  0.723811
1 -1.283886  0.665918  0.203856  0.051358
2  0.552530 -1.328704 -0.095193  0.549880
3  0.268919  0.768329 -0.345025 -1.214268
4  1.612053 -0.460131  1.310339 -0.052109
5  0.262529  0.657633  2.257170  0.653741
6  0.774597 -0.341549 -0.863872 -0.389229
7 -0.242141 -1.213862 -0.819365 -0.849746

In [72]:
s = df.iloc[3]
df.append(s, ignore_index=True)

          A         B         C         D
0 -0.820065  0.689890 -0.094470  0.723811
1 -1.283886  0.665918  0.203856  0.051358
2  0.552530 -1.328704 -0.095193  0.549880
3  0.268919  0.768329 -0.345025 -1.214268
4  1.612053 -0.460131  1.310339 -0.052109
5  0.262529  0.657633  2.257170  0.653741
6  0.774597 -0.341549 -0.863872 -0.389229
7 -0.242141 -1.213862 -0.819365 -0.849746
8  0.268919  0.768329 -0.345025 -1.214268

# Groupement

-> Divise les données par groupes en fonction de certains critères
-> Applique une fonction à chaque groupe indépendamment
-> Combine des résultats dans une structure de données

In [74]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar','foo', 'bar', 'foo', 'foo'],
                    'B' : ['one', 'one', 'two', 'three','two', 'two', 'one', 'three'],
                    'C' : np.random.randn(8),
                    'D' : np.random.randn(8)})
df

     A      B         C         D
0  foo    one -1.227042  1.327174
1  bar    one  0.059538 -0.036850
2  foo    two -0.437956  0.560062
3  bar  three  0.346020 -1.124741
4  foo    two  1.293511 -0.196166
5  bar    two  0.711494 -0.678573
6  foo    one  0.420252  1.080304
7  foo  three  0.627748  0.957610

Groupes et fait la somme des groupes :

In [75]:
df.groupby('A').sum()

            C         D
A
bar  1.117052 -1.840164
foo  0.676513  3.728985

groupement par colonnes multiples

In [76]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one    0.059538 -0.036850
    three  0.346020 -1.124741
    two    0.711494 -0.678573
foo one   -0.806791  2.407478
    three  0.627748  0.957610
    two    0.855555  0.363896

# Remodelage

STACK

In [77]:
 tuples = list(zip(*[['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
 ['one', 'two', 'one', 'two','one', 'two', 'one', 'two']]))
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])
df2 = df[:4]
df2

                     A         B
first second
bar   one     0.153531  0.755966
      two     1.756083 -0.713628
baz   one    -1.047938 -0.152947
      two    -0.131406  0.053705

la méthode stack () "compresse" les colonnes du DataFrame.

In [79]:
stacked = df2.stack()
stacked

first  second
bar    one     A    0.153531
               B    0.755966
       two     A    1.756083
               B   -0.713628
baz    one     A   -1.047938
               B   -0.152947
       two     A   -0.131406
               B    0.053705
dtype: float64

Avec un "DataFrame" ou une série "compressée " (ayant un MultiIndex dans l'index), l'opération inverse de stack () est unstack (), qui par défaut "décompresse"

In [80]:
stacked.unstack()

                     A         B
first second
bar   one     0.153531  0.755966
      two     1.756083 -0.713628
baz   one    -1.047938 -0.152947
      two    -0.131406  0.053705

In [81]:
stacked.unstack(1) // premier niveau

second        one       two
first
bar   A  0.153531  1.756083
      B  0.755966 -0.713628
baz   A -1.047938 -0.131406
      B -0.152947  0.053705

In [82]:
stacked.unstack(0) // 2 eme niveau

first          bar       baz
second
one    A  0.153531 -1.047938
       B  0.755966 -0.152947
two    A  1.756083 -0.131406
       B -0.713628  0.053705